List riyadhData = [
  {
    "name": "الدرعية",
    "description":
        "مهد الدولة السعودية الأولى، وتضم حي الطريف المصنف ضمن التراث العالمي لليونسكو، وتُعد رمزًا للتاريخ الوطني.",
    "image": "assets/images/diriyah.png",
  },
  {
    "name": "قصر المصمك",
    "description":
        "قلعة تاريخية تعكس التراث الثقافي للمملكة، وتقع في قلب الرياض وتُعد نقطة انطلاق لاستكشاف المدينة.",
    "image": "assets/images/musmac.png",
  },
  {
    "name": "حافة العالم",
    "description":
        "تشكّل منحدرات صخرية شاهقة توفر إطلالات خلابة على الصحراء المحيطة، وهي وجهة شهيرة لمحبي المغامرات والتخييم.",
    "image": "assets/images/edgeOfTheWorld.png",
  },
  {
    "name": "Boulevard City",
    "description":
        "وجهة ترفيهية حديثة تضم مجموعة متنوعة من المتاجر والمطاعم والمقاهي، وتوفر تجربة تسوق وترفيه فريدة.",
    "image": "assets/images/blvd.png",
  },
  {
    "name": "مدينة الملك عبدالله المالية",
    "description":
        "مركز مالي حديث يضم مبانٍ شاهقة ومساحات عمل متطورة، ويُعتبر مركزًا للأعمال والابتكار في المملكة.",
    "image": "assets/images/kafd.png",
  },
];

List qassimData = [
  {
    "name": "مهرجان بريدة للتمور",
    "description":
        "يُقام سنويًا في مدينة بريدة، ويُعد من أكبر مهرجانات التمور في العالم، حيث يعرض مجموعة متنوعة من التمور المحلية والعالمية.",
    "image": "assets/images/buraydahDates.png",
  },
  {
    "name": "متحف بريدة",
    "description":
        "متحف يضم مجموعة غنية من القطع الأثرية والتاريخية التي تعكس تراث وثقافة منطقة القصيم والمملكة العربية السعودية بشكل عام.",
    "image": "assets/images/buraydahMuseum.png",
  },
  {
    "name": "مهرجان الكليجا",
    "description":
        "مهرجان ثقافي يحتفي بالكليجا، وهو نوع من الحلويات التقليدية المصنوعة من التمر، ويشمل فعاليات ترفيهية ومسابقات.",
    "image": "assets/images/kulaija.png",
  },
  {
    "name": "مزرعة اكتوبر",
    "description":
        "مزرعة سياحية تقدم تجربة فريدة للزوار للاستمتاع بالطبيعة والأنشطة الزراعية، بالإضافة إلى تقديم منتجات زراعية طازجة.",
    "image": "assets/images/octFarm.png",
  },
  {
    "name": "مزرعة وارف",
    "description":
        "مزرعة عائلية توفر بيئة هادئة وممتعة للزوار، مع مجموعة متنوعة من الأنشطة الترفيهية والتعليمية للأطفال والكبار على حد سواء.",
    "image": "assets/images/wrfFarm.png",
  },
];

List jeddahData = [
  {
    "name": "البلد",
    "description":
        "البلد هو الحي التاريخي في جدة، ويشتهر بمبانيه التقليدية والأسواق القديمة التي تعكس التراث الثقافي للمملكة.",
    "image": "assets/images/albalad.png",
  },
  {
    "name": "City Walk",
    "description":
        "City Walk هو وجهة ترفيهية حديثة تضم مجموعة متنوعة من المتاجر والمطاعم والمقاهي، وتوفر تجربة تسوق وترفيه فريدة.",
    "image": "assets/images/cityWalk.png",
  },
  {
    "name": "نافورة الملك فهد",
    "description":
        "نافورة الملك فهد هي واحدة من أعلى النوافير في العالم، وتقع على ساحل جدة، وتوفر مشهدًا خلابًا خاصة في الليل.",
    "image": "assets/images/kingFahadFountain.png",
  },
  {
    "name": "Winter Wonderland",
    "description":
        "Winter Wonderland هو منتزه ترفيهي يقدم تجربة شتوية فريدة في قلب جدة، مع مجموعة من الألعاب والفعاليات الممتعة للعائلات.",
    "image": "assets/images/winterland.png",
  },
  {
    "name": "مسجد الرحمة",
    "description":
        "مسجد الرحمة، المعروف أيضًا بمسجد العائم، يقع على كورنيش جدة ويتميز بتصميمه المعماري الفريد الذي يجعله يبدو وكأنه يطفو على الماء.",
    "image": "assets/images/mosque.png",
  },
];
